{
    "long_title": null,
    "short_title": "ASE",
    "year": 2022,
    "location": "Ann Arbor, Michigan, United States",
    "from_date": "2022-05-10T00:00:00",
    "to_date": "2022-10-14T00:00:00",
    "important_dates": [
        {
            "date": "2022-04-29T00:00:00",
            "description": "Abstract Submission"
        },
        {
            "date": "2022-05-06T00:00:00",
            "description": "Paper Submission"
        },
        {
            "date": "2022-07-20T00:00:00",
            "description": "Author Notification"
        },
        {
            "date": "2022-09-02T00:00:00",
            "description": "Camera-ready"
        }
    ],
    "url": "https://conf.researchr.org/home/ase-2022",
    "call_for_papers": "## Call for Papers\n\nThe IEEE/ACM Automated Software Engineering (ASE) Conference series is the premier research forum for automated software engineering. Each year, it brings together researchers and practitioners from academia and industry to discuss foundations, techniques, and tools for automating the analysis, design, implementation, testing, and maintenance of large software systems. ASE 2022 invites high-quality contributions describing significant, original, and unpublished results. Solicited topics include, but are not limited to:\n\n\n* **Requirements and Design**\n\t+ requirements elicitation and management, traceability analysis;\n\t+ architecture and design;\n\t+ modeling and model-driven engineering;\n\t+ software product lines;\n\t+ component-based, service-oriented systems;\n\t+ OO/Aspect-oriented;\n* **Testing and Analysis**\n\t+ regression, mutation, model-based testing;\n\t+ program analysis;\n\t+ program synthesis;\n\t+ program repairs\n* **Tools and Processes**\n\t+ release engineering and DevOps;\n\t+ configuration and release management;\n\t+ Agile processes\n* **Maintenance and Evolution**\n\t+ debugging and fault-localization;\n\t+ refactoring and reengineering;\n\t+ reverse engineering;\n\t+ software reuse;\n\t+ API design and management\n* **Formal Aspects of Software Engineering**\n\t+ formal methods, validation and verification;\n\t+ programming languages;\n\t+ specification languages, DSLs\n* **AI and Software Engineering**\n\t+ search-based software engineering;\n\t+ recommender systems;\n\t+ autonomous and self-adapting systems;\n\t+ AI for SE;\n\t+ SE for AI\n* **Software Analytics**\n\t+ mining software repositories;\n\t+ apps and app store analysis\n* **Human Aspects of Software Engineering**\n\t+ program comprehension;\n\t+ systematic reviews, code inspection;\n\t+ human-computer interface;\n\t+ software visualization;\n\t+ crowd-based software engineering;\n\t+ distributed and collaborative software engineering\n* **Social Aspects of Software Engineering**\n\t+ green and sustainable technologies;\n\t+ software economics;\n\t+ ethics in software engineering\n* **Dependability, Safety, and Reliability**\n\t+ privacy and security;\n\t+ reliability;\n\t+ safety;\n\t+ performance\n\n\nASE welcomes submissions addressing topics across the full spectrum of software engineering and a variety of application domains, including mobile, cloud, blockchains, embedded and cyber-physical systems, parallel/distributed/concurrent systems, probabilistic systems, and ubiquitous/pervasive software systems.\n\n\n\n\n---\n\n\n### [Submission Categories and Evaluation Criteria](#submission-categories-and-evaluation-criteria)\n\n\nWe solicit submissions in two categories:\n\n\n**Technical Research Papers**, which describe innovative research in automating software development or automating support to users engaged in software development activities. Papers in this category should:\n\n\n* clearly describe the extent to which the paper’s contributions can impact the field of software engineering and under which assumptions (if any);\n* articulate the novel contribution to the field and carefully support the claims of novelty with citations and discussions of the relevant literature;\n* show that the paper’s contributions and/or innovations address its research questions and are supported by rigorous application of appropriate research methods.\n\n\n**Experience Papers**, which describe a significant experience in applying automated software engineering technology. Papers in this category should:\n\n\n* clearly describe a problem of practical importance, explain how the problem was investigated, and in what context;\n* present evidence for the paper’s conclusions, explaining the insights or best practices that emerged, tools developed, and/or software processes involved;\n* carefully identify and discuss important lessons learned, so that other researchers and/or practitioners can benefit from the experience.\n\n\nPapers in **both categories** should:\n\n\n* discuss the extent to which an independent verification or replication of the paper’s claimed contributions is supported;\n* provide sufficient and clear information to understand how the proposed approach works and how data was obtained, analyzed, and interpreted;\n* include an adequate use of the English language, absence of major ambiguity, and with clearly readable figures and tables;\n* adhere to the formatting instructions provided below.\n\n\nNew Ideas (short) papers are managed and evaluated by a separate track, with its own program committee and deadlines.\n\n\n\n\n---\n\n\n### [Originality](#originality)\n\n\nPapers submitted to ASE 2022 must not have been published elsewhere and must not be under review or submitted for review elsewhere when being considered for ASE 2022. Authors should be aware of the [ACM Policy and Procedures on Plagiarism](https://www.acm.org/publications/policies/plagiarism) and the [IEEE Plagiarism FAQ](https://www.ieee.org/publications/rights/plagiarism/plagiarism-faq.html).\n\n\nTo check for double submission and plagiarism issues, the chairs reserve the right to (1) share the list of submissions with the PC Chairs of other conferences with overlapping review periods and (2) use external plagiarism detection software, under contract to the ACM or IEEE, to detect violations of these policies. Contravention of the submission policy will be deemed a serious breach of scientific ethics and appropriate action will be taken in all such cases.\n\n\n\n\n---\n\n\n### [Double-Anonymous Review Process](#double-anonymous-review-process)\n\n\nThe ASE 2022 Research Track will employ a double-anonymous review process. Thus, no submission may reveal its authors’ identities. The authors must make every effort to honor the double-anonymous review process. In particular:\n\n\n* Authors’ names and affiliated institution names must be omitted from the submission.\n* All references to the author’s prior work should be in the third person.\n* Authors are encouraged to title their submission differently than preprints of the authors on arXiV or similar sites. During review, authors should not publicly use the submission title.\n\n\nFurther advice, guidance, and explanation about the double-anonymous review process can be found in the Q&A page.\n\n\n\n\n---\n\n\n### [Artifact Availability and Supplementary Material](#artifact-availability-and-supplementary-material)\n\n\nWe actively support and encourage all contributing authors to disclose (anonymized and curated) data to increase reproducibility and replicability. Upon submission, authors are asked to make their data available to the program committee (via upload of supplemental material or a link to an anonymous repository) or explain why this is not possible or desirable.\n\n\nSupplementary material can be uploaded via the HotCRP site or anonymously linked from the paper submission. Please carefully review any supplementary material to ensure it conforms to the double-anonymous policy (described above). For example, code and data repositories may be exported to remove version control history, scrubbed of names in comments and metadata, and anonymously uploaded to a sharing site to support review. One resource that may be helpful in accomplishing this task is this blog post:\n\n\n<https://ineed.coffee/5205/how-to-disclose-data-for-double-blind-review-and-make-it-archived-open-data-upon-acceptance/>\n\n\nUpon acceptance, authors will have the possibility to separately submit their supplementary material to the ASE 2022 Artifact Evaluation track, for recognition of artifacts that are reusable, available, replicated, or reproduced.\n\n\n\n\n---\n\n\n### [ACM Policy on Research Involving Humans](#acm-policy-on-research-involving-humans)\n\n\nIf work reported in the paper involves human subjects, authors will be required to affirm compliance with the ACM Policy on Research Involving Humans as part of the submission process: <https://www.acm.org/publications/policies/research-involving-human-participants-and-subjects>\n\n\nIt is the authors’ responsibility (each author individually and the authors collectively) to comply with and provide evidence of compliance with this Policy. Where local ethical review boards are required, authors are responsible for having their research reviewed and approved by such boards. Authors are also responsible for the overall ethical conduct of their research. All ACM Authors must be prepared to provide documentary evidence to ACM that they have adhered to local ethical and legal standards, as ACM may require documentary evidence of such approval at any time following submission of the Work and prior to or after publication of the Work.\n\n\n\n\n---\n\n\n### [Formatting and Submission Guidelines](#formatting-and-submission-guidelines)\n\n\nAbstracts and papers must be submitted electronically through the ASE 2022 HotCRP submission site: <https://ase2022.hotcrp.com/>. All submissions must be in English.\n\n\nFor the abstract submissions, authors are required to specify the title and the abstract of their papers, relevant research areas, and their conflict of interests. This information will be used to select qualified reviewers for each submission. Authors are allowed to augment the paper title/abstract in the full paper submission stage. However, submissions with dummy placeholders for titles/abstracts will be rejected and authors of such submissions will be unable to proceed to the full paper submission stage.\n\n\nFor the full paper submissions, authors are required to upload their paper in the PDF format. It should conform, at time of submission, to the ACM Proceedings Template: <https://www.acm.org/publications/proceedings-template>. LaTEX users must use the `\\documentclass[sigconf,review,anonymous]{acmart}` option.\n\n\nSubmissions must not exceed 10 pages for the main text, including all figures, tables, appendices, etc. Up to two additional pages containing ONLY references are permitted. Submissions that do not adhere to these limits or that violate the formatting guidelines will be desk-rejected without review.\n\n\nExperience papers should contain the phrase “experience paper” prominently in the abstract, to ensure that they are evaluated appropriately.\n\n\nAuthors are encouraged to try out the HotCRP format checker and/or experimental [SIGSOFT Submission Checker](https://github.com/acmsigsoft/submission-checker) to detect violations to the formatting and double-anonymous guidelines. Mind that the tools are based on heuristics. Therefore, they may miss violations or raise false alarms. The requirements listed in this call for papers take precedence over the results of the tools when deciding whether a paper meets the submission guidelines.\n\n\n\n\n---\n\n\n### [Accepted Papers](#accepted-papers)\n\n\nAccepted papers will be permitted an additional page of content to allow authors to incorporate review feedback. The page limit for published papers will therefore be 11 pages (including all figures, tables, appendices) plus 2 pages containing only references. Note that all submitted papers must conform to the 10+2 requirement, described above.\n\n\nAfter acceptance, the list of paper authors cannot be changed under any circumstances. That is, the list of authors on camera-ready papers must be identical to those on submitted papers. Paper titles cannot be changed except by permission of the Track Chairs and only when referees recommended a change for clarity or accuracy with the paper content.\n\n\nWe strongly encourage authors of accepted papers to archive the research artifacts associated with their ASE papers, including code and data, in a repository with a DOI. Popular open-access repositories include, but are not limited to, [Figshare](https://figshare.com/) and [Zenodo](https://zenodo.org/).\n\n\nIf a submission is accepted, at least one author of the paper is required to register for ASE 2022 and present the paper.\n\n\n\n\n---\n\n\n### [Questions and Comments](#questions-and-comments)\n\n\nIf you have any further questions, please contact the PC chairs at [ase2022research@gmail.com](mailto:ase2022research@gmail.com).\n\n\n"
}