{
    "long_title": null,
    "short_title": "ESEC/FSE",
    "year": 2022,
    "location": "Singapore",
    "to_date": "2022-11-18T00:00:00",
    "from_date": "2022-11-14T00:00:00",
    "important_dates": [
        {
            "date": "2022-03-10T00:00:00",
            "description": "Paper registration"
        },
        {
            "date": "2022-03-17T00:00:00",
            "description": "Full paper submission"
        },
        {
            "date": "2022-05-13T00:00:00",
            "description": "1st Rebuttal period (all papers)"
        },
        {
            "date": "2022-05-31T00:00:00",
            "description": "2nd Additional short response period (selected papers)"
        },
        {
            "date": "2022-06-14T00:00:00",
            "description": "Author notification"
        }
    ],
    "url": "https://2022.esec-fse.org/track/fse-2022-research-papers",
    "call_for_papers": "## Call for Papers\n\nWe invite high-quality submissions, from both industry and academia, describing original and unpublished results of theoretical, empirical, conceptual, and experimental software engineering research. Contributions should describe innovative and significant original research. Papers describing groundbreaking approaches to emerging problems will also be considered. Submissions that facilitate reproducibility by using available datasets or making the described tools and datasets publicly available are especially encouraged. For a list of specific topics of interest, please see the end of this call. Papers submitted for consideration to ESEC/FSE should not have been already published elsewhere and should not be under review or submitted for review elsewhere during the reviewing period. Specifically, authors are required to adhere to the ACM Policy and [Procedures on Plagiarism](http://www.acm.org/publications/policies/plagiarism_policy) and the [ACM Policy on Prior Publication and Simultaneous Submissions](http://www.acm.org/publications/policies/simultaneous-submissions).\n\n\n### [How to Submit](#how-to-submit)\n\n\nAt the time of submission, all papers must conform to the [ESEC/FSE 2022 Format and Submission Guidelines](https://2022.esec-fse.org/track/fse-2022-how-to-submit), and must not exceed 10 pages for all text and figures plus 2 pages for references. For Microsoft Word users, please still use the “Interim Template” and not the New Workflow for ACM Publications. All submissions must be in English and in PDF format. You can submit, optionally, an additional file containing supplementary material (see details below). Submissions that do not comply with the above instructions will be desk rejected without review. Papers must be submitted electronically through the ESEC/FSE submission site:\n\n\n<https://esecfse22.hotcrp.com/>\n\n\nEach submission will be reviewed by at least three members of the program committee. Authors will have an opportunity to respond to reviews during a rebuttal period. Submissions will be evaluated on the basis of originality, importance of contribution, soundness, evaluation, quality of presentation and appropriate comparison to related work. Some papers may have more than three reviews, as PC chairs may solicit additional reviews based on factors such as reviewer expertise and strong disagreement between reviewers. The authors will have a chance to read the additional reviews and respond to them during the additional short response period. The program committee as a whole will make final decisions about which submissions to accept for presentation at the conference.\n\n\nESEC/FSE 2022 will employ a **double-blind review process**. The papers submitted must not reveal the authors’ identities in any way:\n\n\n* Authors should leave out author names and affiliations from the body of their submission.\n* Authors should ensure that any citation to related work by themselves is written in third person, that is, “the prior work of XYZ” as opposed to “our prior work”.\n* Authors should not include URLs to author-revealing sites (tools, datasets).\n* You are encouraged to submit a link to a Web site or repository containing supplementary material (raw data, datasets, experiments, etc.), as long as it is blinded. The visit of such sites should not be needed to conduct the review. The program committee will not necessarily consider it in the paper review process. For more information, please read [How to disclose data for double-blind review and make it archived open data upon acceptance](https://ineed.coffee/5205/how-to-disclose-data-for-double-blind-review-and-make-it-archived-open-data-upon-acceptance). As an alternative to having an external link, the submission form provides an option to attach a replication package.\n* Authors should anonymize author-revealing company names but instead provide general characteristics of the organizations involved needed to understand the context of the paper.\n* Authors should ensure that paper acknowledgements do not reveal the origin of their work.\n\n\nThe double-blind process used this year is “heavy”, i.e., the paper anonymity will be maintained during the reviewers’ discussion period and the authors’ rebuttal period. Authors must therefore maintain anonymity in their responses during the rebuttal phases, and provide no additional information that would otherwise be author-revealing.\n\n\nAuthors with further questions on double-blind reviewing are encouraged to contact the program chairs by email. Papers that do not comply with the double-blind review process will be desk-rejected.\n\n\nTo prevent double submissions, the chairs might compare the submissions with related conferences that have overlapping review periods. The double submission restriction applies only to refereed journals and conferences, not to unrefereed forums (e.g. [arXiv.org](http://arxiv.org/)). To check for plagiarism issues, the chairs might use external plagiarism detection software.\n\n\nTo facilitate double-blind reviewing, **we advise the authors to postpone publishing their submitted work on arXiv or similar sites until after the notification of acceptance**. However, if the authors have already published a version of their paper to arXiv or similar sites, we request authors to use a different title for their submission, so that author names are not inadvertently disclosed, e.g., via a notification on Google Scholar.\n\n\nAll publications are subject to the [ACM Author Representations policy](https://www.acm.org/publications/policies/roles-and-responsibilities).\n\n\nAs a published ACM author, you and your co-authors are subject to all [ACM Publications Policies](https://www.acm.org/publications/policies/toc), including ACM’s new [Publications Policy on Research Involving Human Participants and Subjects](https://www.acm.org/publications/policies/research-involving-human-participants-and-subjects).\n\n\n### [Important Dates](#important-dates)\n\n\nAll dates are 23:59:59 AoE (UTC-12h)\n\n\n* Paper registration: 10 March 2022 (to register a paper, only a paper title, an author list and some additional metadata are required)\n* Full paper submission: 17 March 2022\n* 1st Rebuttal period (all papers): 9-13 May, 2022\n* 2nd Additional short response period (selected papers): 30-31 May, 2022\n* Author notification: 14 June 2022\n\n\n### [Open Science Policy](#open-science-policy)\n\n\nThe research track of ESEC/FSE has introduced an open science policy. Openness in science is key to fostering scientific progress via transparency, reproducibility, and replicability. The steering principle is that all research results should be accessible to the public, if possible, and that empirical studies should be reproducible. In particular, we actively support the adoption of open data and open source principles and encourage all contributing authors to disclose (anonymized and curated) data to increase reproducibility and replicability.\n\n\nUpon submission to the research track, authors are asked to make their data available to the program committee (via upload of anonymized supplemental material or a link to an anonymized private or public repository) or to comment on why this is not possible or desirable. While sharing such a repository is not mandatory for submission or acceptance, this information will be passed to the program committee to inform its decision. Furthermore, authors are asked to indicate whether they intend to make their data publicly available upon acceptance. For more details on ESEC/FSE open science policy, please refer to the official guidelines.\n\n\nAuthors of accepted papers will be given an opportunity (and encouragement) to submit their data and tools to the separate ESEC/FSE’21 artifact evaluation committee.\n\n\n### [Topics of Interest](#topics-of-interest)\n\n\nTopics of interest include, but are not limited to:\n\n\n* Artificial intelligence and machine learning for software engineering\n* Autonomic computing\n* Debugging and fault localization\n* Dependability, safety, and reliability\n* Distributed and collaborative software engineering\n* Embedded software, safety-critical systems, and cyber-physical systems\n* Empirical software engineering\n* Formal methods\n* Human-computer interaction\n* Mining software repositories\n* Mobile development\n* Model checking\n* Model-driven engineering\n* Parallel, distributed, and concurrent systems\n* Performance engineering\n* Program analysis\n* Program comprehension\n* Program repair\n* Program synthesis\n* Programming languages\n* Recommendation systems\n* Requirements engineering\n* Search-based software engineering\n* Services, components, and cloud\n* Software architectures\n* Software engineering education\n* Software engineering for machine learning and artificial intelligence\n* Software evolution\n* Software processes\n* Software security\n* Software testing\n* Software traceability\n* Symbolic execution\n* Tools and environments\n\n\n"
}