{
    "long_title": null,
    "short_title": "ICPC",
    "year": 2022,
    "location": null,
    "to_date": "2022-05-17T00:00:00",
    "from_date": "2022-05-16T00:00:00",
    "important_dates": [
        {
            "date": "2022-01-13T00:00:00",
            "description": "Abstract Submission"
        },
        {
            "date": "2022-01-18T00:00:00",
            "description": "Paper Submission"
        },
        {
            "date": "2022-02-24T00:00:00",
            "description": "Author Response Period"
        },
        {
            "date": "2022-03-08T00:00:00",
            "description": "Acceptance Notification"
        },
        {
            "date": "2022-03-31T00:00:00",
            "description": "Camera Ready"
        }
    ],
    "url": "https://conf.researchr.org/track/icpc-2022/icpc-2022-research",
    "call_for_papers": "## Call for Papers\n\nThe International Conference on Program Comprehension (ICPC) is the premier venue for work in the area of software program comprehension. It encompasses human activities for comprehending the software as well as methodologies and technologies for supporting such comprehension.\n\n\nThe research track provides a quality forum for researchers and practitioners from academia, industry, and government to present and discuss new results in program comprehension. Topics of interest for all tracks include but are not limited to:\n\n\n* Empirical evaluations of program comprehension tools, techniques, and approaches;\n* Human aspects in program comprehension, including collaborative software engineering practices, gender considerations, information processing strategies, the role of emotions, and more;\n* Cognitive theories for program comprehension accompanied by different empirical strategies, including experiments, surveys, and case studies;\n* Topics at the intersection between program comprehension and programming education;\n* Individual, collaborative, distributed, and global program comprehension;\n* Novel visualization or summarization techniques and interfaces to support program comprehension, including searching, browsing, and analyzing;\n* Comprehension of specific types of software systems, such as open/closed source, mobile applications, spreadsheets, web-based systems, legacy systems, product lines, libraries, multi-threaded applications, and systems of systems;\n* Comprehension in the context of diverse software process models and specific lifecycle activities, such as: maintenance, evolution, re-engineering, migration, security, auditing, and testing;\n* Comprehension of software artifacts ranging from requirements documents to test cases and crash logs; from API documentation to models, meta-models and model transformation; and from Stack Overflow questions & answers to GitHub code review messages or video tutorials - all software artifacts and formal or informal documentation that software developers encounter when creating or evolving software;\n* Comprehension and legal issues, such as due diligence, intellectual property and licensing, reverse engineering, and litigation;\n* Issues and case studies in the transfer of program comprehension technology to industry;\n* Tool support for program comprehension.\n\n\nA subset of the Research Track papers accepted for presentation at ICPC 2022 **will be invited to be revised and extended for consideration in a thematic special issue of the Springer’s Empirical Software Engineering Journal (EMSE)**. The best papers of the research track will be awarded with an **ACM SIGSOFT Distinguished Paper Award** at ICPC. In addition, ICPC 2022 will feature **ICPC Honorable Mentions**, special awards that will be assigned, on the basis of the program committee reports, to the papers that have applied extremely novel and/or outstanding research methods to the problem of interest.\n\n\n### [Format and Submission](#format-and-submission)\n\n\nSubmissions must not be longer than 10 pages for the main text, inclusive of figures, tables, and appendices. Two more pages containing only references are permitted. All submissions must be in PDF. The page limit is strict, and it will not be possible to purchase additional pages at any point in the process (including after the paper is accepted).\n\n\nSubmissions must conform to the [ACM Article Template](https://www.acm.org/publications/proceedings-template). LaTeX users should use the sigconf option, as well as the review (to produce line numbers for easy reference by the reviewers) and anonymous (omitting author names) options. To that end, the following LaTeX code can be placed at the start of the LaTeX document:\n\n\n\n```\n\\documentclass[sigconf,review,anonymous]{acmart}\n\n\\acmConference[ICPC 2022]{The 30th International Conference on Program Comprehension}{May 21–22, 2022}{Pittsburgh, PA, USA}\n\n```\n\nAlterations of spacing, font size, and other changes that deviate from the instructions may result in desk rejection without further review.\n\n\nBy submitting to the ICPC Research Track, authors acknowledge that they are aware of and agree to be bound by the ACM Policy and Procedures on Plagiarism and the IEEE Plagiarism FAQ. In particular, papers submitted to ICPC 2022 **must not have been published elsewhere and must not be under review or submitted for review elsewhere whilst under consideration for ICPC 2022**. Contravention of this concurrent submission policy will be deemed a serious breach of scientific ethics, and appropriate actions will be taken in all such cases. To check for double submission and plagiarism issues, the chairs reserve the right to (1) share the list of submissions with the PC Chairs of other conferences with overlapping review periods and (2) use external plagiarism detection software, under contract to the ACM or IEEE, to detect violations of these policies.\n\n\nThe ICPC 2022 Research Track will employ a **double-anonymous review process**. Thus, no submission may reveal its authors’ identities. The authors must make every effort to honor the double-anonymous review process. In particular:\n\n\n* **Authors’ names** must be omitted from the submission.\n* All **references** to the author’s prior work should be in the third person.\n* The **title of the submission** must be different from preprints of the authors on ArXiV or similar sites. During review, authors **must not publicly use the submission title**.\n\n\n**Any submission that does not comply with these requirements may be desk rejected without further review.**\n\n\nThe submission must also comply with the [authorship policy of the ACM](https://www.acm.org/publications/policy-on-authorship), and the [authorship policy of the IEEE](https://journals.ieeeauthorcenter.ieee.org/become-an-ieee-journal-author/publishing-ethics/definition-of-authorship/).\n\n\nICPC 2022 follows the ACM SIGSOFT rules on Conflicts of Interest and Confidentiality of Submissions and all authors, reviewers, and organizers will uphold the ACM Code of \\* Ethics and Professional Conduct.\n\n\nSubmissions to the Research Track that meet the above requirements can be made via the [ICPC submission site](https://icpc2022.hotcrp.com) by the submission deadline.\n\n\n### [Open Science Policy](#open-science-policy)\n\n\nThe research track of ICPC 2022 is striving to abide by Open Science policies. In summary, the steering principle is that all research results should be accessible to the public, if possible, and that empirical studies should be reproducible. In particular, we actively support the adoption of open data and open source principles and encourage all contributing authors to disclose (anonymized and curated) data to increase reproducibility and replicability. Note that sharing research data is not mandatory for submission or acceptance. However, sharing is expected to be the default, and non-sharing needs to be justified.\n\n\nUpon submission to the research track, authors are asked\n\n\n* to make their data available to the program committee (via upload of supplemental material or a link to an anonymous repository) – and provide instructions on how to access this data in the paper; **or**\n* to include in the paper an explanation as to why this is not possible or desirable; **and**\n* to indicate if they intend to make their data publicly available upon acceptance.\n\n\nSupplementary material can be uploaded via the ICPC submission site or anonymously linked from the paper submission. Authors are asked to carefully review any supplementary material to ensure it conforms to the double-anonymous policy (described above). For example, code and data repositories may be exported to remove version control history, scrubbed of names in comments and metadata, and anonymously uploaded to a sharing site to support review. One resource that may be helpful in accomplishing this task is this blog post.\n\n\n### [Review and Evaluation Criteria](#review-and-evaluation-criteria)\n\n\nResearch papers will be reviewed by at least three members of the Program Committee. Submissions will be evaluated based on the following criteria:\n\n\n* **Soundness**: The extent to which the paper’s contributions are supported by rigorous application of appropriate research methods;\n* **Significance**: The extent to which the paper’s contributions impact program comprehension, and if needed, under which assumptions;\n* **Novelty**: The extent to which the contributions are sufficiently original with respect to the state-of-the-art and clearly explained and contrasted against it;\n* **Verifiability**: The extent to which the paper includes sufficient information to support independent verification or replication of the paper’s claimed contributions;\n* **Presentation**: The extent to which the paper’s quality of writing meets the standards of ICPC, including clear descriptions and explanations, appropriate use of the English language, absence of major ambiguity, clearly readable figures and tables, and adherence to the formatting instructions provided below.\n\n\nReviewers will carefully consider all of these criteria during the review process, and authors should take great care in clearly addressing them all. The paper should clearly explain the claimed contributions, and how they are sound, significant, novel, and verifiable, as described above.\n\n\n### [Author Response Period](#author-response-period)\n\n\nICPC 2022 will offer a six day author response period. In this period the authors will have the opportunity to inspect the reviews, and answer specific questions raised by the program committee. This period is scheduled after all reviews have been completed, and serves to inform the subsequent decision making process. Authors will be able to see the full reviews, including the reviewer scores as part of the author response process.\n\n\n### [Withdrawing a Paper](#withdrawing-a-paper)\n\n\nAuthors can withdraw their paper at any moment until the final decision has been made, through the paper submission system. Resubmitting the paper to another venue before the final decision has been made without withdrawing from ICPC 2022 first is considered a violation of the concurrent submission policy, and will lead to automatic rejection from ICPC 2022 as well as any other venue adhering to this policy.\n\n\n### [Publication and Presentation](#publication-and-presentation)\n\n\nUpon notification of acceptance, all authors of accepted papers will receive further instructions for preparing the camera-ready versions of their submissions. If a submission is accepted, at least one author of the paper is required to register for ICPC 2022, attend the conference (physically or virtually) and present the paper. All accepted papers will be published in the conference electronic proceedings. The presentation is expected to be delivered in person, unless this is impossible due to travel limitations (related to, e.g., health, visa, or COVID-19 prevention). Details about the presentations will follow the notifications.\n\n\nThe official publication date is the date the proceedings are made available in the ACM or IEEE Digital Libraries. This date may be up to two weeks prior to the first day of ICSE 2022. The official publication date affects the deadline for any patent filings related to published work.\n\n\nPurchases of additional pages in the proceedings is not allowed.\n\n\n"
}