{
    "long_title": null,
    "short_title": "ICSE",
    "year": 2022,
    "location": null,
    "to_date": "2022-05-27T00:00:00",
    "from_date": "2022-05-08T00:00:00",
    "important_dates": [
        {
            "date": "2021-08-27T00:00:00",
            "description": "Abstract Submissions (Required) Deadline"
        },
        {
            "date": "2021-09-03T00:00:00",
            "description": "Paper Submissions Deadline"
        },
        {
            "date": "2021-11-13T00:00:00",
            "description": "Author Response Period"
        },
        {
            "date": "2021-12-03T00:00:00",
            "description": "Acceptance Notification"
        },
        {
            "date": "2022-02-11T00:00:00",
            "description": "Camera Ready Deadline"
        },
        {
            "date": "2022-03-31T00:00:00",
            "description": "Registration Deadline For ICSE Authors"
        },
        {
            "date": "2022-04-01T00:00:00",
            "description": "Early Registration Deadline"
        },
        {
            "date": "2022-05-13T00:00:00",
            "description": "Virtual Conference"
        },
        {
            "date": "2022-05-27T00:00:00",
            "description": "In-Person Conference"
        }
    ],
    "url": "https://conf.researchr.org/track/icse-2022/icse-2022-papers",
    "call_for_papers": "## Call for Papers\n\nICSE is the premier forum for presenting and discussing the most recent and significant technical research contributions in the field of Software Engineering. In the technical track, we invite high quality submissions of technical research papers describing original and unpublished results of software engineering research.\n\n\nPlease note the following important changes for 2022:\n\n\n1. Point out the **significance of your research contributions** (see review criteria).\n2. Follow our **open science policy** – share data and justify if you do not.\n3. Give your submission a **unique title** that is different from preprints and talks.\n\n\n### [Research of Interest](#research-of-interest)\n\n\nICSE welcomes submissions addressing topics across the full spectrum of Software Engineering, being inclusive of quantitative, qualitative, and mixed-methods research. Topics of interest include:\n\n\n* **AI and software engineering**, including\n\n\n\t+ Search-based software engineering\n\t+ Machine learning with and for SE\n\t+ Recommender systems\n\t+ Autonomic systems and self adaptation\n\t+ Program synthesis\n\t+ Program repair\n\t+ Software fairness\n* **Testing and analysis**, including\n\n\n\t+ Software testing\n\t+ Program analysis\n\t+ Debugging and Fault localization\n\t+ Programming languages\n\t+ Performance\n\t+ Mobile applications\n* **Software analytics**, including\n\n\n\t+ Mining software repositories\n\t+ Apps and app store analysis\n\t+ Software ecosystems\n\t+ Configuration management\n\t+ Software visualization\n* **Software evolution**, including\n\n\n\t+ Evolution and maintenance\n\t+ API design and evolution\n\t+ Release engineering and DevOps\n\t+ Software reuse\n\t+ Refactoring\n\t+ Program comprehension\n\t+ Reverse engineering\n* **Social aspects of software engineering**, including\n\n\n\t+ Human aspects of software engineering\n\t+ Human-computer interaction\n\t+ Distributed and collaborative software engineering\n\t+ Agile methods and software processes\n\t+ Software economics\n\t+ Crowd-based software engineering\n\t+ Ethics in software engineering\n\t+ Green and sustainable technologies\n* **Requirements, modeling, and design,** including\n\n\n\t+ Requirements Engineering\n\t+ Privacy and Security by Design\n\t+ Modeling and Model-Driven Engineering\n\t+ Software Architecture and Design\n\t+ Variability and product lines\n\t+ Software services\n* **Dependability**, including\n\n\n\t+ Formal methods\n\t+ Validation and Verification\n\t+ Reliability and Safety\n\t+ Privacy and Security\n\t+ Embedded and cyber-physical systems\n\n\n### [Review Criteria](#review-criteria)\n\n\nEach paper submitted to the Technical Track will be evaluated based on the following criteria:\n\n\n* **Soundness**: The extent to which the paper’s contributions and/or innovations address its research questions and are supported by rigorous application of appropriate research methods\n* **Significance**: The extent to which the paper’s contributions can impact the field of software engineering, and under which assumptions (if any)\n* **Novelty**: The extent to which the contributions are sufficiently original with respect to the state-of-the-art\n* **Verifiability and Transparency**: The extent to which the paper includes sufficient information to understand how an innovation works; to understand how data was obtained, analyzed, and interpreted; and how the paper supports independent verification or replication of the paper’s claimed contributions\n* **Presentation**: The extent to which the paper’s quality of writing meets the high standards of ICSE, including clear descriptions, as well as adequate use of the English language, absence of major ambiguity, clearly readable figures and tables, and adherence to the formatting instructions provided below.\n\n\nReviewers will carefully consider all of these criteria during the review process, and authors should take great care in clearly addressing them all. The paper should clearly explain the claimed contributions, and how they are sound, significant, novel, and verifiable, as described above.\n\n\nFor more information on how the ICSE PC will interpret and use these criteria in the paper evaluation process, see the [ICSE 2022 Review Process and Guidelines](https://conf.researchr.org/getImage/icse-2022/orig/ICSE+2022+Review+Process+and+Guidelines-2.pdf).\n\n\n### [How to Submit](#how-to-submit)\n\n\nAll authors should use the official “ACM Primary Article Template”, as can be obtained from the [ACM Proceedings Template page](https://www.acm.org/publications/proceedings-template). LaTeX users should use the `sigconf` option, as well as the `review` (to produce line numbers for easy reference by the reviewers) and `anonymous` (omitting author names) options. To that end, the following LaTeX code can be placed at the start of the LaTeX document:\n\n\n`\\documentclass[sigconf,review,anonymous]{acmart}`\n\n\n`\\acmConference[ICSE 2022]{The 44th International Conference on Software Engineering}{May 21–29, 2022}{Pittsburgh, PA, USA}`\n\n\n* All submissions must not exceed 10 pages for the main text, inclusive of all figures, tables, appendices, etc. Two more pages containing only references are permitted. All submissions must be in PDF. Accepted papers will be allowed one extra page for the main text of the camera-ready version.\n* Submissions **must strictly conform to the ACM formatting instructions**. Alterations of spacing, font size, and other changes that deviate from the instructions may result in desk rejection without further review.\n* By submitting to the ICSE Technical Track, authors acknowledge that they are aware of and agree to be bound by the [ACM Policy and Procedures on Plagiarism](https://www.acm.org/publications/policies/plagiarism) and the [IEEE Plagiarism FAQ](https://www.ieee.org/publications/rights/plagiarism/plagiarism.html). In particular, papers submitted to ICSE 2022 **must not have been published elsewhere and must not be under review or submitted for review elsewhere whilst under consideration for ICSE 2022**. Contravention of this concurrent submission policy will be deemed a serious breach of scientific ethics, and appropriate action will be taken in all such cases. To check for double submission and plagiarism issues, the chairs reserve the right to (1) share the list of submissions with the PC Chairs of other conferences with overlapping review periods and (2) use external plagiarism detection software, under contract to the ACM or IEEE, to detect violations of these policies.\n* The ICSE 2022 Technical Track will employ a **double-anonymous review process**. Thus, no submission may reveal its authors’ identities. The authors must make every effort to honor the double-anonymous review process. In particular:\n\n\n\t+ **Authors’ names** must be omitted from the submission.\n\t+ All **references** to the author’s prior work should be in the third person.\n\t+ Authors are encouraged to **title their submission differently** than preprints of the authors on ArXiV or similar sites. During review, authors **should not publicly use the submission title**.Further advice, guidance, and explanation about the double-anonymous review process can be found in the [Q&A page](https://conf.researchr.org/track/icse-2022/icse-2022-submitting-to-icse2022--q-a).\n* By submitting to the ICSE Technical Track, authors acknowledge that they conform to the [authorship policy of the ACM](https://www.acm.org/publications/policies/authorship), and the [authorship policy of the IEEE](https://journals.ieeeauthorcenter.ieee.org/become-an-ieee-journal-author/publishing-ethics/definition-of-authorship/).\n\n\nSubmissions to the Technical Track that meet the above requirements can be made via the Technical Track submission site (<https://icse2022.hotcrp.com>) by the submission deadline. **Any submission that does not comply with these requirements may be desk rejected without further review.**\n\n\nWe encourage the authors to upload their paper info early (and can submit the PDF later) to properly enter conflicts for double-anonymous reviewing. Authors are encouraged to try out the experimental [SIGSOFT Submission Checker](https://github.com/acmsigsoft/submission-checker) to detect violations to the formatting and double anonymous guidelines. (Mind that the tool is based on heuristics. Therefore it may miss violations, and it can raise false alarms. The requirements listed in this call for papers take precedence over the results of the tool when deciding whether a paper meets the submission guidelines.)\n\n\n### [Open Science Policy](#open-science-policy)\n\n\nThe research track of ICSE 2022 is governed by the [ICSE 2022 Open Science policies](https://conf.researchr.org/track/icse-2022/icse-2022-open-science-policies). In summary, the steering principle is that all research results should be accessible to the public and, if possible, empirical studies should be reproducible. In particular, we actively support the adoption of open data and open source principles and encourage all contributing authors to disclose (anonymized and curated) data to increase reproducibility and replicability. Note that sharing research data is not mandatory for submission or acceptance. However, sharing is expected to be the default, and non-sharing needs to be justified. We recognize that reproducibility or replicability is not a goal in qualitative research and that, similar to industrial studies, qualitative studies often face challenges in sharing research data. For guidelines on how to report qualitative research to ensure the assessment of the reliability and credibility of research results, see the [Q&A page](https://conf.researchr.org/track/icse-2022/icse-2022-submitting-to-icse2022--q-a).\n\n\nUpon submission to the research track, authors are asked\n\n\n* to make their data available to the program committee (via upload of supplemental material or a link to an anonymous repository) – and provide instructions on how to access this data in the paper; **or**\n* to include in the paper an explanation as to why this is not possible or desirable; **and**\n* to indicate if they intend to make their data publicly available upon acceptance.\n\n\nSupplementary material can be uploaded via the HotCRP site or anonymously linked from the paper submission. Although PC members are not required to look at this material, we strongly encourage authors to use supplementary material to provide access to anonymized data, whenever possible. Authors are asked to carefully review any supplementary material to ensure it conforms to the double-anonymous policy (described above). For example, code and data repositories may be exported to remove version control history, scrubbed of names in comments and metadata, and anonymously uploaded to a sharing site to support review. One resource that may be helpful in accomplishing this task is [this blog post](https://ineed.coffee/5205/how-to-disclose-data-for-double-blind-review-and-make-it-archived-open-data-upon-acceptance/).\n\n\nUpon acceptance, authors have the possibility to separately submit their supplementary material to the [ICSE 2022 Artifact Evaluation track](https://conf.researchr.org/track/icse-2022/icse-2022-artifact-evaluation), for recognition of artifacts that are reusable, available, replicated or reproduced.\n\n\n### [Mentoring for Prospective Authors](#mentoring-for-prospective-authors)\n\n\nWe are organizing an “Ask me Anything” (AMA) Session on Best practices for a successful ICSE paper in June for prospective authors to learn from the 2021 ICSE PC co-chairs, [Arie van Deursen](https://conf.researchr.org/profile/icse-2021/arievandeursen) and [Tao Xie](https://conf.researchr.org/profile/icse-2021/taoxie).\n\n\nThis event takes place on two dates, one for each hemisphere:\n\n\n* [**Wed 30 June**, 17:00 CET (11:00 ET / 08:00 PT / 23:00 Beijing)](https://www.timeanddate.com/worldclock/fixedtime.html?msg=ICSE+2022+Ask+Me+Anything+Session&iso=20210630T17&p1=37&ah=1) - “Atlantic\" time zones\n* [**Thu, 01 July** 08:00 CET (02:00 ET / 23:00 PT, one day earlier / 14:00 Beijing)](https://www.timeanddate.com/worldclock/fixedtime.html?msg=ICSE+2022+Ask+Me+Anything+Session&iso=20210701T08&p1=37&ah=1) - “Pacific” time zones\n\n\nTo participate in the event, [please register here](https://forms.gle/uByPuAtEhX1greD76). Deadline for registration is **June 24**,\n\n\n### [Author Response Period](#author-response-period)\n\n\nICSE 2022 will offer a three day author response period. In this period the authors will have the opportunity to inspect the reviews, and to answer specific questions raised by the program committee. This period is scheduled after all reviews have been completed, and serves to inform the subsequent decision making process. Authors will be able to see the full reviews, including the reviewer scores as part of the author response process.\n\n\n### [Withdrawing a Paper](#withdrawing-a-paper)\n\n\nAuthors can withdraw their paper at any moment until the final decision has been made, through the paper submission system. Resubmitting the paper to another venue before the final decision has been made without withdrawing from ICSE 2022 first is considered a violation of the concurrent submission policy, and will lead to automatic rejection from ICSE 2022 as well as any other venue adhering to this policy.\n\n\n### [Important Dates](#important-dates)\n\n\n* Technical Track Abstract Submissions (Required) Deadline: August 27, 2021\n* Technical Track Submissions Deadline: September 3, 2021\n* Technical Track Author Response Period: November 10–13, 2021\n* Technical Track Acceptance Notification: December 3, 2021\n* Technical Track Camera Ready: February 11, 2022\n\n\n### [Conference Attendance Expectation](#conference-attendance-expectation)\n\n\nIf a submission is accepted, at least one author of the paper is required to register for ICSE 2022 and present the paper. **[We will add more info on this as soon as the ICSE 2022 format is finalized.]**\n\n\n"
}