{
    "long_title": null,
    "short_title": "ICST",
    "year": 2022,
    "location": null,
    "from_date": "2022-05-04T00:00:00",
    "to_date": "2022-04-08T00:00:00",
    "important_dates": [
        {
            "date": "2021-09-27T00:00:00",
            "description": "Abstract Submission Deadline"
        },
        {
            "date": "2021-10-04T00:00:00",
            "description": "Full Paper Submission Deadline"
        },
        {
            "date": "2021-12-06T00:00:00",
            "description": "Author Notification"
        },
        {
            "date": "2022-02-04T00:00:00",
            "description": "Camera Ready Deadline"
        }
    ],
    "url": "https://icst2022.vrain.upv.es",
    "call_for_papers": "## Call for Papers\n\nICST 2022 (<https://icst2022.vrain.upv.es/>) invites high-quality submissions in all areas of software testing, verification, and validation. Papers for the research track should present novel and original work that advances the state-of-the-art. Case studies and empirical research papers are also welcome.\n\n\n#### [Topics of Interest](#topics-of-interest)\n\n\nTopics of interest include, but are not limited to, the following:\n\n\n* Fuzz testing\n* Manual testing practices and techniques\n* Search-based software testing\n* Security testing\n* Model-based testing\n* Test automation\n* Static analysis and symbolic execution\n* Formal verification and model checking\n* Software reliability\n* Testability and design\n* Testing and development processes\n* Testing education\n* Testing in specific domains, such as mobile, web, embedded, concurrent, distributed, cloud, GUI, and real-time systems\n* Testing for learning-enabled software, including deep learning\n* Testing video games, augmented reality\n* Testing for cyber-physical systems\n* Testing/debugging tools\n* Theory of software testing\n* Empirical studies\n* Experience reports\n\n\nEach submission will be reviewed by at least three members of the ICST Program Committee.\n\n\nPapers that have a strong industrial/practical component and focus more on impact rather than (technical) novelty are encouraged to consider the industry track instead.\n\n\n#### [Submission Format](#submission-format)\n\n\nFull Research papers, as well as Industry papers, must conform to the two-column IEEE conference publication format, not exceed 10 pages, including all text, figures, tables, and appendices; two additional pages containing only references are permitted. It must conform to the [IEEE Conference Proceedings Formatting Guidelines](https://www.ieee.org/conferences/publishing/templates.html) (please use the letter format template and conference option). **The ICST 2022 research track only accepts full research papers. Short papers are not accepted to the research track.**\n\n\nThe submission must also comply with the [ACM plagiarism policy and procedures](https://www.acm.org/publications/policies/plagiarism). In particular, it must not have been published elsewhere and must not be under review elsewhere while under review for ICST. The submission must also comply with the [IEEE Policy on Authorship](https://journals.ieeeauthorcenter.ieee.org/become-an-ieee-journal-author/publishing-ethics/).\n\n\nLastly, the ICST 2022 Research papers track will employ a double-blind review process. Thus, no submission may reveal its authors’ identities. The authors must make every effort to honor the double-blind review process. In particular, the authors’ names must be omitted from the submission, and references to their prior work should be in the third person. Further advice, guidance, and explanation about the double-blind review process can be found in the [Q&A page](https://icst2022.vrain.upv.es/track/icst-2022-papers#Submitting-to-ICST2022-Q-A).\n\n\nSubmissions to the Research Papers Track that meet the above requirements can be made via **EasyChair** (<https://easychair.org/conferences/?conf=icst2022>).\n\n\nAny submission that does not comply with the above requirements may be rejected by the PC Chairs without further review.\n\n\nIf a submission is accepted, at least one author of the paper is required to attend the conference and present the paper for it to be published in the ICST 2022 conference proceedings.\n\n\n#### [Replication Material](#replication-material)\n\n\nSubmissions must supply all information that is needed to replicate the results, and therefore are expected to include or point to a replication package with the necessary software, data, and instructions. Reviewers may consult these packages to resolve open issues. There can be good reasons for the absence of a replication package, such as confidential code and/or data, the research being mostly qualitative, or the paper being fully self-contained. If a paper does not come with a replication package, authors should comment on its absence in the submission data; reviewers will take such comments into account.\n\n\n"
}