{
    "long_title": null,
    "short_title": "MSR",
    "year": 2022,
    "location": null,
    "from_date": "2022-05-23T00:00:00",
    "to_date": "2022-05-24T00:00:00",
    "important_dates": [
        {
            "date": "2022-01-17T00:00:00",
            "description": "Abstract Deadline"
        },
        {
            "date": "2022-01-20T00:00:00",
            "description": "Paper Deadline"
        },
        {
            "date": "2022-02-24T00:00:00",
            "description": "Author Response Period"
        },
        {
            "date": "2022-03-08T00:00:00",
            "description": "Author Notification"
        },
        {
            "date": "2022-03-31T00:00:00",
            "description": "Camera Ready Deadline"
        }
    ],
    "url": "https://conf.researchr.org/home/msr-2022",
    "call_for_papers": "## Call for Papers\n\nThe Mining Software Repositories (MSR) conference is the premier conference for data science, machine learning, and artificial intelligence in software engineering. The goal of the conference is to improve software engineering practices by uncovering interesting and actionable information about software systems and projects using the vast amounts of software data such as source control systems, defect tracking systems, code review repositories, archived communications between project personnel, question-and-answer sites, CI build servers, and run-time telemetry. Mining this information can help to understand software development and evolution, software users, and runtime behavior; support the maintenance of software systems; improve software design/reuse; empirically validate novel ideas and techniques; support predictions about software development; and exploit this knowledge in planning future development. The goal of this two-day international conference is to advance the science and practice of software engineering with data-driven techniques. The 19th International Conference on Mining Software Repositories will be held on May 23-24, 2022.\n\n\n## [Evaluation Criteria](#evaluation-criteria)\n\n\nResearch papers are expected to describe new methodologies and/or provide novel research results, and should be evaluated scientifically. While a high degree of technical rigor is expected for long papers, short research papers should discuss controversial issues in the field, or describe interesting or thought-provoking ideas that are not yet fully developed. Accepted short papers will be presented in a short lightning talk. Relevant review criteria:\n\n\n* soundness of approach\n* relevance to software engineering\n* clarity of relation with related work\n* quality of presentation\n* quality of evaluation [for long papers]\n* ability to replicate [for long papers]\n* novelty\n\n\n## [Submission Process](#submission-process)\n\n\nAll authors should use the official “ACM Primary Article Template”, as can be obtained from the [ACM Proceedings Template page](https://www.acm.org/publications/proceedings-template). LaTeX users should use the `sigconf` option, as well as the review (to produce line numbers for easy reference by the reviewers) and `anonymous` (omitting author names) options. To that end, the following LaTeX code can be placed at the start of the LaTeX document:\n\n\n`\\documentclass[sigconf,review,anonymous]{acmart}`\n\n\n`\\acmConference[MSR 2022]{MSR '22: Proceedings of the 19th International Conference on Mining Software Repositories}{May 23–24, 2022}{Pittsburgh, PA, USA}`\n\n\nSubmissions to the Technical Track can be made via the [submission site](https://msr2022-technical.hotcrp.com/) by the submission deadline. We encourage authors to upload their paper info early (the PDF can be submitted later) to properly enter conflicts for anonymous reviewing. All submissions must adhere to the following requirements:\n\n\n* Submissions must not exceed the page limit (10 pages plus 2 additional pages of references for full papers; 4 pages plus 1 additional page of references for short papers). The page limit is strict, and it will not be possible to purchase additional pages at any point in the process (including after acceptance).\n* Submissions must strictly conform to the [ACM formatting instructions](https://www.acm.org/publications/proceedings-template). Alterations of spacing, font size, and other changes that deviate from the instructions may result in desk rejection without further review.\n* Submissions must not reveal the authors’ identities. The authors must make every effort to honor the double-anonymous review process. In particular, the authors’ names must be omitted from the submission and references to their prior work should be in the third person. Further advice, guidance, and explanation about the double-anonymous review process can be found in the [Q&A page for ICSE 2022](https://conf.researchr.org/track/icse-2022/icse-2022-submitting-to-icse2022--q-a).\n\n\nAny submission that does not comply with these requirements is likely to be desk rejected by the PC Chairs without further review. In addition, by submitting to the MSR Technical Track, the authors acknowledge that they are aware of and agree to be bound by the following policies:\n\n\n* The [ACM Policy and Procedures on Plagiarism](https://www.acm.org/publications/policies/plagiarism-overview) and the [IEEE Plagiarism FAQ](https://www.ieee.org/publications/rights/plagiarism/plagiarism.html). In particular, papers submitted to MSR 2022 must not have been published elsewhere and must not be under review or submitted for review elsewhere whilst under consideration for MSR 2022. Contravention of this concurrent submission policy will be deemed a serious breach of scientific ethics, and appropriate action will be taken in all such cases (including immediate rejection and reporting of the incident to ACM/IEEE). To check for double submission and plagiarism issues, the chairs reserve the right to (1) share the list of submissions with the PC Chairs of other conferences with overlapping review periods and (2) use external plagiarism detection software, under contract to the ACM or IEEE, to detect violations of these policies.\n* The [authorship policy of the ACM](https://www.acm.org/publications/policies/authorship) and the [authorship policy of the IEEE](https://journals.ieeeauthorcenter.ieee.org/become-an-ieee-journal-author/publishing-ethics/definition-of-authorship/).\n\n\nUpon notification of acceptance, all authors of accepted papers will be asked to fill a copyright form and will receive further instructions for preparing the camera-ready version of their papers. At least one author of each paper is expected to register and present the paper at the MSR 2022 conference. All accepted contributions will be published in the electronic proceedings of the conference.\n\n\nA selection of the best papers will be invited to an [Empirical Software Engineering (EMSE)](https://link.springer.com/journal/10664) Special Issue. The authors of accepted papers that show outstanding contributions to the FOSS community will have a chance to self-nominate their paper for the MSR FOSS Impact Paper Award. Please note that providing a replication package is strongly recommended even in double-anonymous submissions, since not providing one effectively hinders the peer-review process. Since access to data and scripts is essential during peer review, we strongly recommend to archive data sets on online archival sites such as dropbox.com, zenodo.org or figshare.com (Instructions available in Open Science Policy below). The latter two even allow to receive a DOI and hence become citable.\n\n\n## [Submission Link](#submission-link)\n\n\nPapers must be submitted through HotCRP: <https://msr2022-technical.hotcrp.com/>\n\n\n## [Shadow PC](#shadow-pc)\n\n\nWe are continuing the Shadow PC process established at MSR 2021. The Shadow PC provides an opportunity to recruit and train the next generation of MSR researchers on reviewing MSR papers. The primary audience is PhD students and Post Docs who have not yet served on the MSR PC. They will review papers submitted to MSR and have a parallel program committee. We will have experienced MSR researchers look at the reviews and comments and give feedback to the Shadow PC. This has been done in other venues like EuroSys and USENIX.\n\n\nWe are requesting authors to volunteer their paper to be reviewed by the Shadow PC. This is purely a learning experience, and the reviews from the Shadow PC will not be visible to the regular PC and will not impact the decision of the paper in MSR. The authors may request the reviews from the Shadow PC. The reviews and comments will be in a completely different HotCRP installation to prevent any cross-over. Therefore, we are requesting authors to please volunteer their papers. There will be an option in the submission page for this. When you volunteer you are not only helping future generations of MSR researchers become better reviewers, but you also will get more feedback on your work.\n\n\n## [Important Dates](#important-dates)\n\n\n* Abstract Deadline: Jan 17\n* Paper Deadline: Jan 20\n* Author Response Period: Feb 22 – Feb 24\n* Author Notification: March 8\n* Camera Ready Deadline: Late March\n\n\n## [Open Science Policy](#open-science-policy)\n\n\nOpenness in science is key to fostering progress via transparency, reproducibility and replicability. Our steering principle is that all research output should be accessible to the public and that empirical studies should be reproducible. In particular, we actively support the adoption of open data and open source principles. The following guidelines are recommendations and not mandatory. Your choice to use open science or not will not affect the review process for your paper. However, to increase reproducibility and replicability, we encourage all contributing authors to disclose:\n\n\n* the source code of relevant software used or proposed in the paper, including that used to retrieve and analyze data\n* the data used in the paper (e.g., evaluation data, anonymized survey data, etc.)\n* instructions for other researchers describing how to reproduce or replicate the results\n\n\nAlready upon submission, authors can privately share their anonymized data and software on preserved archives, such as [Zenodo](https://zenodo.org/) or [Figshare](https://figshare.com/) ([tutorial available here](https://ineed.coffee/5205/how-to-disclose-data-for-double-blind-review-and-make-it-archived-open-data-upon-acceptance/) please make sure that any links shared during peer review are anonymized\\*). Zenodo accepts up to 50GB per dataset (more upon request). There is no need to use Dropbox or Google Drive. Once accepted, an option can be toggled to publish the data and scripts with an official DOI. Zenodo and Figshare accounts can easily be linked with GitHub repositories to automatically archive software releases. In the unlikely case that authors need to upload terabytes of data, <Archive.org> may be used. After acceptance, we encourage authors to self-archive pre-prints of their papers in open, preserved repositories such as arXiv.org. This is legal and allowed by all major publishers including ACM and IEEE, and it lets anybody in the world reach your paper. Note that you are usually not allowed to self-archive the PDF of the published article (that is, the publisher proof or the Digital Library version). Instead, use the manuscript with reviewer comments addressed, but before applying the camera-ready instructions and templates. Feel free to contact the MSR 2021 PC or proceedings chairs for more details. We recognise that anonymising artifacts such as source code is more difficult than preserving anonymity in a paper. We ask authors to take a best effort approach to not reveal their identities. We will also ask reviewers to avoid trying to identify authors by looking at commit histories and other such information that is not easily anonymised. Authors wanting to share GitHub repositories may want to look into using <https://anonymous.4open.science/> which is an open source tool that helps you to quickly double-blind your repository. Please note that the success of the open science initiative depends on the willingness (and possibilities) of authors to disclose their data and that all submissions will undergo the same review process independent of whether or not they disclose their analysis code or data. We encourage authors who cannot disclose industrial or otherwise non-public data, for instance due to non-disclosure agreements, to provide an explicit (short) statement in the paper.\n\n\n## [Accepted Papers and Attendance Expectation](#accepted-papers-and-attendance-expectation)\n\n\nAccepted papers will be permitted an additional page of content to allow authors to incorporate review feedback. The page limit for published papers will therefore be 11 pages for full papers (or 5 pages, for short papers), plus 2 pages which may only contain references.\n\n\n* The official publication date is the date the proceedings are made available in the ACM or IEEE Digital Libraries. This date may be up to two weeks prior to the first day of the ICSE 2022. The official publication date affects the deadline for any patent filings related to published work.\n* Purchases of additional pages in the proceedings is not allowed.\n\n\nAfter acceptance, the list of paper authors can not be changed under any circumstances and the list of authors on camera-ready papers must be identical to those on submitted papers. After acceptance paper titles can not be changed except by permission of the Program Co-Chairs, and only then when referees recommended a change for clarity or accuracy with paper content.\n\n\nIf a submission is accepted, at least one author of the paper is required to register for MSR 2022 and present the paper. [We will add more info on this as soon as the MSR 2022 format is finalized.]\n\n\n"
}