{
    "long_title": null,
    "short_title": "PLDI",
    "year": 2022,
    "location": "San Diego, California, United States",
    "to_date": "2022-06-17T00:00:00",
    "from_date": "2022-06-13T00:00:00",
    "important_dates": [
        {
            "date": "2021-11-19T00:00:00",
            "description": "Submission Deadline"
        },
        {
            "date": "2022-02-09T00:00:00",
            "description": "Author Response"
        },
        {
            "date": "2022-02-25T00:00:00",
            "description": "Author Notification"
        }
    ],
    "url": "https://pldi22.sigplan.org/track/pldi-2022-pldi",
    "call_for_papers": "## Call for Papers\n\nPLDI is a premier forum for programming language research, broadly construed, including design, implementation, theory, applications, and performance. PLDI seeks outstanding research that extends and/or applies programming-language concepts to advance the field of computing. Novel system designs, thorough empirical work, well-motivated theoretical results, and new application areas are all welcome emphases in strong PLDI submissions.\n\n\n### [Evaluation Criteria and Process](#evaluation-criteria-and-process)\n\n\nReviewers will evaluate each contribution for its accuracy, significance, originality, and clarity. Submissions should be organized to communicate clearly to a broad programming-language audience as well as to experts on the paper’s topics. Papers should identify what has been accomplished and how it relates to previous work.\n\n\nAuthors of empirical papers are encouraged to consider the seven categories of the [SIGPLAN Empirical Evaluation Guidelines](http://www.sigplan.org/Resources/EmpiricalEvaluation/) when preparing their submissions.\n\n\nDeadlines and formatting requirements, detailed below, will be strictly enforced, with extremely rare extenuating circumstances considered at the discretion of the Program Chair.\n\n\nIn almost all cases, reviews will be performed by a subset of the Program Committee (PC). Authors will have the opportunity to respond to initial reviews to correct and clarify technical concerns. The PC will make final accept/reject decisions.\n\n\nAuthors may contact only the Program Chair about submitted papers during and after the review process. Contacting PC members about submitted paper(s) is an ethical violation and may be grounds for summary rejection.\n\n\n### [Double-Blind Reviewing](#double-blind-reviewing)\n\n\nPLDI uses double-blind reviewing. This means that author names and affiliations must be omitted from the submission. Additionally, if the submission refers to prior work done by the authors, that reference should be made in third person. These are firm submission requirements. Any supplementary material must also be anonymized.\n\n\nThe [FAQ on Double-Blind Reviewing](https://pldi22.sigplan.org/track/pldi-2022-papers#FAQ-on-Double-Blind-Reviewing-) clarifies the policy for the most common scenarios. But there are many gray areas and trade-offs. If you have any doubts about how to interpret the double-blind rules, please contact the Program Chair. **Overestimate the need to contact the Program Chair for complex cases that are not fully covered by the FAQ.**\n\n\n### [Submission Site Information](#submission-site-information)\n\n\nThe submission site is <https://pldi2022.hotcrp.com>.\n\n\nAuthors can submit multiple times prior to the (firm!) deadline. Only the last submission will be reviewed. There is no abstract deadline. The submission site requires entering author names and affiliations, relevant topics, and potential conflicts. Addition or removal of authors after the submission deadline will need to be approved by the Program Chair (as this kind of change potentially undermines the goal of eliminating conflicts during paper assignment).\n\n\nThe submission deadline is **11:59PM November 19, 2021 anywhere on earth**: <https://en.wikipedia.org/wiki/Anywhere_on_Earth>\n\n\n### [Declaring Conflicts](#declaring-conflicts)\n\n\nWhen submitting the paper, you will need to declare potential conflicts. Conflicts should be declared between an adviser and an advisee (e.g., Ph.D., post-doc). Other conflicts include institutional conflicts, financial conflicts of interest, friends or relatives, or any recent co-authors on papers and proposals (last 2 years).\n\n\nPlease do not declare spurious conflicts: such incorrect conflicts are especially harmful if the aim is to exclude potential reviewers, so spurious conflicts can be grounds for rejection. If you are unsure about a conflict, please consult the Program Chair.\n\n\n### [Formatting Requirements](#formatting-requirements)\n\n\nPapers should be formatted according to the two-column ACM proceedings format. Each paper should have no more than **12 pages, excluding bibliography, in 10pt font**. There is no limit on the page count for references. Each reference must list all authors of the paper (do not use et al). The citations should be in numeric style, e.g., [52]. Submissions should be in PDF format and printable on US Letter and A4 sized paper. These requirements are all the same as in the previous year.\n\n\nPapers that exceed the length requirement or deviate from the expected format will be rejected.\n\n\nMake sure that figures and tables are legible, even after the paper is printed in gray-scale.\n\n\nAppendices should not be part of the paper, but should be submitted as supplementary material. Supplementary material should also be anonymized, as described below. These requirements are also the same as last year.\n\n\nAs explained in more detail at <http://www.sigplan.org/Resources/Author>, authors should use the sigplan subformat of the acmart format by downloading [pldi2022.zip](https://pldi22.s3.amazonaws.com/pldi2022.zip). Please note the following:\n\n\n* The `acmart-sigplanproc-template.tex` template included in the above zip file has the correct defaults for PLDI 2022 submissions. Specifically, the first two lines should be\n\n\n\n```\n\\documentclass[sigplan,10pt,review,anonymous]{acmart}\n\\settopmatter{printfolios=true,printccs=false,printacmref=false}\n\n```\n\nThe default citation style is numeric. \\* Do not mess with the class file or settings to try to sneak in additional space. (Conversely, you may toggle the `printccs` and `printacmref` flags if you wish, but these changes will consume space.) \\* Do not use the PACMPL files or format; PLDI is not using them. However, the template files were designed to make migrating a paper from one format to the other as simple as possible.\n\n\n### [Supplementary Material](#supplementary-material)\n\n\nAuthors are free to provide supplementary material if that material supports the claims in the paper. Such material may include proofs, experimental results, and/or data sets. This material should be uploaded at the same time as the submission. Reviewers are not required to examine the supplementary material but may refer to it if they would like to find further evidence supporting the claims in the paper.\n\n\n### [Plagiarism and Concurrent Work](#plagiarism-and-concurrent-work)\n\n\nPapers must describe unpublished work that is not currently submitted for publication elsewhere as described by the SIGPLAN Republication Policy: <http://www.sigplan.org/Resources/Policies/Republication/>. Authors should also be aware of the ACM Policy on Plagiarism: <https://www.acm.org/publications/policies/plagiarism-overview>. Concurrent submissions to other conferences, workshops, journals, or similar venues of publication are disallowed. Prior work must, as always, be cited and referred to in the third person even if it is the authors’ work, so as to preserve author anonymity. If you have further questions, contact the Program Chair.\n\n\n### [Artifact Evaluation for Accepted Papers](#artifact-evaluation-for-accepted-papers)\n\n\nThe authors of accepted PLDI papers will be invited to submit supporting materials to the Artifact Evaluation process. Artifact Evaluation is run by a separate committee whose task is to assess how well the artifacts support the work described in the papers. This submission is voluntary but encouraged and will not influence the final decision regarding the papers. Papers that go through the Artifact Evaluation process successfully will receive a badge printed on the papers themselves. Authors of accepted papers are encouraged to make these materials publicly available upon publication of the proceedings, by including them as “source materials” in the ACM Digital Library.\n\n\n### [Accepted Papers](#accepted-papers)\n\n\nAccepted papers will be made available (once the conference starts and for one month following) via 1-click download from the ACM Digital Library.\n\n\nPLDI welcomes all authors, regardless of nationality. If authors are unable despite reasonable effort to obtain visas to travel to the conference, we will make arrangements to enable remote participation or presentation by another attendee on behalf of the authors.\n\n\n### [Publication Date](#publication-date)\n\n\nAUTHORS TAKE NOTE: The official publication date is the date the proceedings are made available in the ACM Digital Library. This date may be up to two weeks prior to the first day of your conference. The official publication date affects the deadline for any patent filings related to published work. (For those rare conferences whose proceedings are published in the ACM Digital Library after the conference is over, the official publication date remains the first day of the conference.)\n\n\n### [Acknowledgments](#acknowledgments)\n\n\nThis call-for-papers is an adaptation and evolution of content from previous instances of PLDI. We are grateful to prior organizers for their work, which is reused here.\n\n\n"
}