{
    "long_title": null,
    "short_title": "POPL",
    "year": 2023,
    "location": null,
    "to_date": "2023-01-21T00:00:00",
    "from_date": "2023-01-15T00:00:00",
    "important_dates": [
        {
            "date": "2022-07-07T00:00:00",
            "description": "Submission Deadline"
        },
        {
            "date": "2022-09-09T00:00:00",
            "description": "Author Response Period"
        },
        {
            "date": "2022-09-26T00:00:00",
            "description": "Notification of Conditional Acceptance"
        },
        {
            "date": "2022-10-21T00:00:00",
            "description": "Submission of Revisions"
        },
        {
            "date": "2022-10-31T00:00:00",
            "description": "Notification of Final Acceptance"
        },
        {
            "date": "2022-11-03T00:00:00",
            "description": "Camera-Ready Deadline"
        }
    ],
    "url": "https://conf.researchr.org/home/POPL-2023",
    "call_for_papers": "## POPL 2023 Call for Papers\n\nPACMPL Issue POPL 2023 seeks contributions on all aspects of programming languages and programming systems, both theoretical and practical. Authors of papers published in PACMPL Issue POPL 2023 will be invited to present their work in the POPL conference in January 2023, which is sponsored by ACM SIGPLAN, in cooperation with ACM SIGACT and ACM SIGLOG.\n\n\nThis call for contributions is subject to change.\n\n\n### [Scope](#scope)\n\n\nPrinciples of Programming Languages is a forum for the discussion of all aspects of programming languages and programming systems. Both theoretical and experimental papers are welcome, on topics ranging from formal frameworks to experience reports. We seek submissions that make principled, enduring contributions to the theory, design, understanding, implementation or application of programming languages.\n\n\n### [Evaluation Criteria](#evaluation-criteria)\n\n\nThe Review Committee will evaluate the technical contribution of each submission as well as its accessibility to both experts and the general POPL audience. All papers will be judged on significance, originality, relevance, correctness, and clarity. Each paper must explain its scientific contribution in both general and technical terms, identifying what has been accomplished, explaining why it is significant, and comparing it with previous work. Advice on writing technical papers can be found on the [SIGPLAN author information page](http://www.sigplan.org/Resources/Author/).\n\n\n### [Evaluation Process](#evaluation-process)\n\n\nAuthors will have a multi-day period to respond to reviews, as indicated in the Important Dates table. Responses are optional. A response must be concise, addressing specific points raised in review; in particular, it must not introduce new technical results. Reviewers will write a short reaction to these author responses. The Review Committee will discuss papers entirely electronically rather than at a physical meeting. This will avoid the time, cost, and environmental impact of transporting an increasingly large committee to one point on the globe. There is no formal External Review Committee, though experts outside the committee will be consulted. Reviews will be accompanied by a short summary of the reasons behind the committee’s decision with the goal of clarifying the reasons behind the decision.\n\n\nFor additional information about the reviewing process, see:\n\n\n* [Principles of POPL](http://popl.mpi-sws.org/PrinciplesofPOPL.pdf): a presentation of the underlying organizational and reviewing policies for POPL.\n* [Frequently asked questions](https://popl19.sigplan.org/track/POPL-2019-Research-Papers?#Submission-and-Reviewing-FAQ) about the reviewing and submission process, especially double-blind reviewing.\n\n\nTo conform with ACM requirements for journal publication, all POPL papers will be conditionally accepted; authors will be required to submit a short description of the changes made to the final version of the paper, including how the changes address any requirements imposed by the Review Committee. That the changes are sufficient will be confirmed by the original reviewers prior to acceptance to POPL. Authors of conditionally accepted papers must submit a satisfactory revision to the Review Committee by the requested deadline or risk rejection.\n\n\n### [Submission Guidelines](#submission-guidelines)\n\n\nThe following two points are easy to overlook:\n\n\n* Conflicts: Each author of a submission has to log into the submission system and properly declare all potential conflicts of interest in the author profile form. A conflict caught late in the reviewing process leads to a voided review which may be infeasible to replace.\n* Anonymity: POPL 2023 will employ a lightweight double-blind reviewing process. Make sure that your submitted paper is fully anonymized.\n\n\nPrior to the paper submission deadline, the authors will upload their full anonymized paper. Each paper should have no more than 25 pages of text, excluding bibliography, using the new ACM Proceedings format. This format is chosen for compatibility with PACMPL. It is a single-column page layout with a 10 pt font, 12 pt line spacing, and wider margins than recent POPL page layouts. In this format, the main text block is 5.478 in (13.91 cm) wide and 7.884 in (20.03 cm) tall. Use of a different format (e.g., smaller fonts or a larger text block) is grounds for summary rejection. PACMPL templates for Microsoft Word and LaTeX can be found at the [SIGPLAN author information page](http://www.sigplan.org/Resources/Author/). In particular, authors using LaTeX should use the [acmart-pacmpl-template.tex](http://www.sigplan.org/sites/default/files/acmart/current/acmart-pacmpl-template.tex) file (with the acmsmall option). Submissions should be in PDF and printable on both US Letter and A4 paper. Papers may be resubmitted to the submission site multiple times up until the deadline, but the last version submitted before the deadline will be the version reviewed. Papers that exceed the length requirement, that deviate from the expected format, or that are submitted late will be rejected.\n\n\nDeadlines expire at the end of the day, [anywhere on earth](https://en.wikipedia.org/wiki/Anywhere_on_Earth) on the Important Dates displayed to the right. Submitted papers must adhere to the [SIGPLAN Republication Policy](http://www.sigplan.org/Resources/Policies/Republication/) and the [ACM Policy on Plagiarism](https://www.acm.org/publications/policies/plagiarism-overview). Concurrent submissions to other conferences, workshops, journals, or similar forums of publication are not allowed.\n\n\nPOPL 2023 will employ a lightweight double-blind reviewing process. To facilitate this, submitted papers must adhere to two rules:\n\n\n1. author names and institutions must be omitted, and\n2. references to authors’ own related work should be in the third person (e.g., not “We build on our previous work …” but rather “We build on the work of …”).\n\n\nThe purpose of this process is to help the Review Committee and external reviewers come to an initial judgment about the paper without bias, not to make it impossible for them to discover the authors if they were to try. Nothing should be done in the name of anonymity that weakens the submission or makes the job of reviewing the paper more difficult. In particular, important background references should not be omitted or anonymized. In addition, authors are free to disseminate their ideas or draft versions of their paper as usual. For example, authors may post drafts of their papers on the web or give talks on their research ideas. A document answering frequently asked questions addresses many common concerns.\n\n\nThe submission itself is the object of review and so it should strive to convince the reader of at least the plausibility of reported results. Still, we encourage authors to provide any supplementary material that is required to support the claims made in the paper, such as detailed proofs, proof scripts, or experimental data. These materials must be uploaded at submission time, as a single pdf or a tarball, not via a URL. Two forms of supplementary material may be submitted.\n\n\n1. Anonymous supplementary material is available to the reviewers before they submit their first-draft reviews.\n2. Non-anonymous supplementary material is available to the reviewers after they have submitted their first-draft reviews and learned the identity of the authors.\n\n\nUse the anonymous form if possible. Reviewers are under no obligation to look at the supplementary material but may refer to it if they have questions about the material in the body of the paper.\n\n\n### [Artifact Evaluation](#artifact-evaluation)\n\n\nAuthors of accepted papers will be invited to formally submit supporting materials to the Artifact Evaluation process. Artifact Evaluation is run by a separate committee whose task is to assess how the artifacts support the work described in the papers. This submission is voluntary and will not influence the final decision regarding the papers. Papers that go through the Artifact Evaluation process successfully will receive a seal of approval printed on the papers themselves. Authors of accepted papers are encouraged to make these materials publicly available upon publication of the proceedings, by including them as “source materials” in the ACM Digital Library.\n\n\n### [Copyright, Publication, and Presentation](#copyright-publication-and-presentation)\n\n\nAs a Gold Open Access journal, PACMPL is committed to making peer-reviewed scientific research free of restrictions on both access and (re-)use. Authors are strongly encouraged to support libre open access by licensing their work with the [Creative Commons Attribution 4.0 International (CC BY) license](https://creativecommons.org/licenses/by/4.0/), which grants readers liberal (re-)use rights.\n\n\nAuthors of accepted papers will be required to choose one of the following publication rights:\n\n\n* Author licenses the work with a [Creative Commons license](https://creativecommons.org/), retains copyright, and (implicitly) grants ACM non-exclusive permission to publish (suggested choice).\n* Author retains copyright of the work and grants ACM a non-exclusive permission to publish license.\n* Author retains copyright of the work and grants ACM an exclusive permission to publish license.\n* Author transfers copyright of the work to ACM.\n\n\nThese choices follow from ACM Copyright Policy and ACM Author Rights, corresponding to ACM’s “author pays” option. While PACMPL may ask authors who have funding for open-access fees to voluntarily cover the article processing charge (currently, US$400), payment is not required for publication. PACMPL and SIGPLAN continue to explore the best models for funding open access, focusing on approaches that are sustainable in the long-term while reducing short-term risk.\n\n\nAll papers will be archived by the ACM Digital Library. Authors will have the option of including supplementary material with their paper. The official publication date is the date the proceedings are made available in the ACM Digital Library. This date may be up to two weeks prior to the first day of the conference. The official publication date affects the deadline for any patent filings related to published work.\n\n\nAuthors of accepted papers are required to give a short talk (roughly 25 minutes long) at the conference, according to the conference schedule.\n\n\n### [Distinguished Paper Awards](#distinguished-paper-awards)\n\n\nAt most 10% of the accepted papers of POPL 2023 will be designated as Distinguished Papers. This award highlights papers that the Review Committee thinks should be read by a broad audience due to their relevance, originality, significance and clarity. The selection of the distinguished papers will be made based on the final version of the paper and through a [second review process](https://docs.google.com/document/d/1tdloeVfirvrKIN9hQukeVVphdwlR95Et9rxVqduMTRI/edit#heading=h.4ep38co4qj40).\n\n\n"
}